In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2013-01-01 -0.524493 -2.194909  0.963128 -0.925660
2013-01-02 -0.147589 -0.705153  0.890283  0.883174
2013-01-03 -0.384027 -0.648264 -0.142395  1.136645
2013-01-04  1.106992 -1.422007 -0.842762  2.968905
2013-01-05  1.521651  2.672649  1.011713  1.743960
2013-01-06 -1.522526  0.605077  2.066440  0.317594

In [5]:
df.head(3)

                   A         B         C         D
2013-01-01 -0.524493 -2.194909  0.963128 -0.925660
2013-01-02 -0.147589 -0.705153  0.890283  0.883174
2013-01-03 -0.384027 -0.648264 -0.142395  1.136645

In [6]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [8]:
df.values

array([[-0.52449293, -2.19490863,  0.96312824, -0.92565992],
       [-0.14758932, -0.70515262,  0.89028342,  0.88317449],
       [-0.38402675, -0.64826415, -0.14239473,  1.13664499],
       [ 1.10699176, -1.42200747, -0.8427616 ,  2.96890489],
       [ 1.52165051,  2.67264928,  1.01171298,  1.74395966],
       [-1.52252609,  0.60507734,  2.06644034,  0.31759441]])

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [10]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.008335 -0.282101  0.657735  1.020770
std    1.122753  1.719820  1.014770  1.314050
min   -1.522526 -2.194909 -0.842762 -0.925660
25%   -0.489376 -1.242794  0.115775  0.458989
50%   -0.265808 -0.676708  0.926706  1.009910
75%    0.793346  0.291742  0.999567  1.592131
max    1.521651  2.672649  2.066440  2.968905

In [11]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-05  1.521651  2.672649  1.011713  1.743960
2013-01-06 -1.522526  0.605077  2.066440  0.317594
2013-01-03 -0.384027 -0.648264 -0.142395  1.136645
2013-01-02 -0.147589 -0.705153  0.890283  0.883174
2013-01-04  1.106992 -1.422007 -0.842762  2.968905
2013-01-01 -0.524493 -2.194909  0.963128 -0.925660

In [12]:
df

                   A         B         C         D
2013-01-01 -0.524493 -2.194909  0.963128 -0.925660
2013-01-02 -0.147589 -0.705153  0.890283  0.883174
2013-01-03 -0.384027 -0.648264 -0.142395  1.136645
2013-01-04  1.106992 -1.422007 -0.842762  2.968905
2013-01-05  1.521651  2.672649  1.011713  1.743960
2013-01-06 -1.522526  0.605077  2.066440  0.317594

In [13]:
df['A']

2013-01-01   -0.524493
2013-01-02   -0.147589
2013-01-03   -0.384027
2013-01-04    1.106992
2013-01-05    1.521651
2013-01-06   -1.522526
Freq: D, Name: A, dtype: float64

In [14]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.524493 -2.194909  0.963128 -0.925660
2013-01-02 -0.147589 -0.705153  0.890283  0.883174
2013-01-03 -0.384027 -0.648264 -0.142395  1.136645

In [15]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.147589 -0.705153  0.890283  0.883174
2013-01-03 -0.384027 -0.648264 -0.142395  1.136645
2013-01-04  1.106992 -1.422007 -0.842762  2.968905

In [16]:
df.loc[dates[0]]

A   -0.524493
B   -2.194909
C    0.963128
D   -0.925660
Name: 2013-01-01 00:00:00, dtype: float64

In [17]:
df.loc[:,['A', 'B']]

                   A         B
2013-01-01 -0.524493 -2.194909
2013-01-02 -0.147589 -0.705153
2013-01-03 -0.384027 -0.648264
2013-01-04  1.106992 -1.422007
2013-01-05  1.521651  2.672649
2013-01-06 -1.522526  0.605077

In [18]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02 -0.147589 -0.705153
2013-01-03 -0.384027 -0.648264
2013-01-04  1.106992 -1.422007

In [19]:
df.loc[dates[0], 'A']

-0.524492932563724

In [20]:
df.iloc[3]

A    1.106992
B   -1.422007
C   -0.842762
D    2.968905
Name: 2013-01-04 00:00:00, dtype: float64

In [21]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  1.106992 -1.422007
2013-01-05  1.521651  2.672649

In [22]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.147589  0.890283
2013-01-03 -0.384027 -0.142395
2013-01-05  1.521651  1.011713

In [23]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.147589 -0.705153  0.890283  0.883174
2013-01-03 -0.384027 -0.648264 -0.142395  1.136645

In [24]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -2.194909  0.963128
2013-01-02 -0.705153  0.890283
2013-01-03 -0.648264 -0.142395
2013-01-04 -1.422007 -0.842762
2013-01-05  2.672649  1.011713
2013-01-06  0.605077  2.066440

In [25]:
df

                   A         B         C         D
2013-01-01 -0.524493 -2.194909  0.963128 -0.925660
2013-01-02 -0.147589 -0.705153  0.890283  0.883174
2013-01-03 -0.384027 -0.648264 -0.142395  1.136645
2013-01-04  1.106992 -1.422007 -0.842762  2.968905
2013-01-05  1.521651  2.672649  1.011713  1.743960
2013-01-06 -1.522526  0.605077  2.066440  0.317594

In [26]:
df[df.A > 0]

                   A         B         C         D
2013-01-04  1.106992 -1.422007 -0.842762  2.968905
2013-01-05  1.521651  2.672649  1.011713  1.743960

In [27]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN       NaN  0.963128       NaN
2013-01-02       NaN       NaN  0.890283  0.883174
2013-01-03       NaN       NaN       NaN  1.136645
2013-01-04  1.106992       NaN       NaN  2.968905
2013-01-05  1.521651  2.672649  1.011713  1.743960
2013-01-06       NaN  0.605077  2.066440  0.317594

In [28]:
df2 = df.copy()

In [29]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01 -0.524493 -2.194909  0.963128 -0.925660    one
2013-01-02 -0.147589 -0.705153  0.890283  0.883174    one
2013-01-03 -0.384027 -0.648264 -0.142395  1.136645    two
2013-01-04  1.106992 -1.422007 -0.842762  2.968905  three
2013-01-05  1.521651  2.672649  1.011713  1.743960   four
2013-01-06 -1.522526  0.605077  2.066440  0.317594  three

In [30]:
df2['E'].isin(['two', 'four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [31]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03 -0.384027 -0.648264 -0.142395  1.136645   two
2013-01-05  1.521651  2.672649  1.011713  1.743960  four

In [32]:
df

                   A         B         C         D
2013-01-01 -0.524493 -2.194909  0.963128 -0.925660
2013-01-02 -0.147589 -0.705153  0.890283  0.883174
2013-01-03 -0.384027 -0.648264 -0.142395  1.136645
2013-01-04  1.106992 -1.422007 -0.842762  2.968905
2013-01-05  1.521651  2.672649  1.011713  1.743960
2013-01-06 -1.522526  0.605077  2.066440  0.317594

In [33]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01 -0.524493 -2.194909  0.963128 -0.925660
2013-01-02 -0.672082 -2.900061  1.853412 -0.042485
2013-01-03 -1.056109 -3.548325  1.711017  1.094160
2013-01-04  0.050883 -4.970333  0.868255  4.063064
2013-01-05  1.572533 -2.297684  1.879968  5.807024
2013-01-06  0.050007 -1.692606  3.946409  6.124619

In [34]:
df.apply(lambda x: x.max() - x.min())

A    3.044177
B    4.867558
C    2.909202
D    3.894565
dtype: float64